InformationRegisters/НастройкиСистемыБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемыБронированияКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьОтборПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиСистемыБронированияКомандировок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьИзмененияНастроекСистемыБронирования(СистемаБронирования, ИспользоватьОтборПоПодразделениям = Истина) Экспорт

	Если СистемаБронирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиСистемыБронированияКомандировок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СистемаБронирования.Установить(СистемаБронирования);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.СистемаБронирования = СистемаБронирования;
		НоваяЗапись.ИспользоватьОтборПоПодразделениям = ИспользоватьОтборПоПодразделениям;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		Запись.ИспользоватьОтборПоПодразделениям = ИспользоватьОтборПоПодразделениям;
		
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);

КонецПроцедуры

Функция ИспользуетсяОтборПоПодразделениям(СистемаБронирования) Экспорт

	Если СистемаБронирования = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Запись = РегистрыСведений.НастройкиСистемыБронированияКомандировок.СоздатьМенеджерЗаписи();
	Запись.СистемаБронирования = СистемаБронирования;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ИспользоватьОтборПоПодразделениям;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
